porousHemodynamic4HD/thrombosis/system/cellSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      cellSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

name            SMPF;
action          new;
topoSetSources
(
    surfaceToCell
    {
        file            "thrombosis.stl";
        outsidePoints   ((25.2958 8.12998 14.0381));
        includeCut      true;
        includeInside   true;
        includeOutside  false;
        nearDistance    -1;
        curvature       0.9;
    }
);

// ************************************************************************* //
